
create database project default charset utf8;

create table `user`(

	`id` 			int 			auto_increment 	primary key,
	`nickname` 		varchar(20),
	`pwd` 			char(32)  		not null,
	`tel` 			char(11) 		not null unique,
	`sex` 			tinyint(1) 	default 1 	comment '1-男 2-女',
	`birthday` 		date,
	`address` 		varchar(100),
	`status` 		tinyint(1) 	default 1  comment '1-激活 2-禁用',
	`regtime` 		int,
	`email`			varchar(30)




)engine=myisam default charset=utf8;


insert into `user`(`nickname`, `pwd`,       `tel`,       `sex`, `birthday`,  `email`,         `address`,    `status`, `regtime`) values
					('小王', md5('123456'), '15000000001', 1, '2002-12-03', '88997@163.com' ,'青花楼老宋床底下', 1, '1548384200'),
					('亚瑟', md5('123456'), '15000000002', 1, '1970-10-01', '88997@163.com' ,'召唤师峡谷', 1, '1548384200'),
					('钟馗', md5('123456'), '15000000003', 1, '1995-11-11', '88997@163.com' ,'召唤师峡谷', 2, '1548382600'),
					('老宋', md5('123456'), '15000000004', 1, '2006-07-18', '88997@163.com' ,'宝马车上',   1, '1548382537'),
					('貂蝉', md5('123456'), '15000000005', 2, '2017-02-13', '88997@163.com' ,'吕布or董卓别墅',   1, '1548384240'),
					('本伟', md5('123456'), '17000000001', 1, '1990-10-10', '88997@163.com' ,'绝地海岛监狱', 1, '1548384200'),
					('无名', md5('123456'), '17000000002', 2, '1941-05-27', '88997@163.com' ,null,   2, '1548380735'),
					('路飞', md5('123456'), '17000000003', 1, '1999-09-01', '88997@163.com' ,'海贼王岛',   1, '1548384270'),
					('鸣人', md5('123456'), '17000000004', 1, '1985-12-13', '88997@163.com' ,'木叶忍者村', 1, '1548384200'),
					('奥马', md5('123456'), '17000000005', 1, '1957-11-25', '88997@163.com' ,'黑宫顶层', 1, '1548384204'),
					('晋四', md5('123456'), '17000000006', 1, '2015-06-06', '88997@163.com' ,null, 2, '1548384213'),
					('星爷', md5('123456'), '17000000007', 1, '1962-10-10', '88997@163.com' ,'太师华府', 1, '1548381853'),
					('波师', md5('123456'), '13000000001', 2, '2000-01-01', '88997@163.com' ,'老王隔壁', 1, '1548384200'),
					('苍师', md5('123456'), '13000000002', 2, '2001-10-01', '88997@163.com' ,'老王隔壁', 1, '1548384259'),
					('小泽', md5('123456'), '13000000003', 2, '2002-06-01', '88997@163.com' ,'老王隔壁', 1, '1548384200'),
					('小飞', md5('123456'), '13000000004', 1, '2009-09-09', '88997@163.com' ,'老王下面', 1, '1548384200');
					('home', md5('123456'), '13000230004', 1, '2009-09-09', '88997@163.com' ,'老王下面', 1, '1548384200');
					
		

-- 后台用户表
create table `admin`(

	`id` 			int 		unsigned 		auto_increment 		primary key,
	`name` 			varchar(50)		not null		unique,
	`pwd` 			char(32)  		not null

)engine=myisam default charset=utf8;

insert into `admin`(`name`,`pwd`) values
	('赵一',md5('123456')),
	('钱二',md5('123456')),
	('孙三',md5('123456')),
	('李四',md5('123456')),
	('周五',md5('123456')),
	('吴六',md5('123456')),
	('郑七',md5('123456')),
	('王八',md5('123456')),
	('冯九',md5('123456')),
	('陈十',md5('123456'));
	('admin',md5('123456'));


-- 商品分类列表
create table `category`(

`id`		int 			not null	  auto_increment	primary key,
`name`		varchar(50)		not null 	unique,
`pid`		int 			not null	default 0	comment '0-顶级分类',
`path`		varchar(255)	not null	default 0	comment '一级分类',
`display`	tinyint			not null	default 2	comment '1-显示,2-隐藏'

)engine=myisam default charset=utf8;
    
    
insert into `category`(`name`,`pid`,`path`,`display`) values
	('911系列','0','0,','1'),
	('911Air系列','0','0,','1'),
	('9代CPU上市','0','0,','1'),
	('外设系列','0','0,','1'),
	('台式机','0','0,','1'),
	('分期购','0','0,','1'),
	('免费试用','0','0,','1'),
	('积分商城','0','0,','1'),
	('服务','0','0,','1'),
	('同城会','0','0,','1'),
	('品牌介绍','0','0,','1');

insert into `category`(`name`,`pid`,`path`,`display`) values
	-- ('雷神911SE钢版','1','0,1,','1'),
	-- ('雷神911MT黑骑士','1','0,1,','1'),
	-- ('雷神911M星耀版','1','0,1,','1'),
	-- ('雷神911SE炫彩版','1','0,1,','1'),
	-- ('雷神911黑幽灵电竞版','1','0,1,','1'),
	-- ('雷神911Air星战版','2','0,2,','1'),
	-- ('雷神911Air电竞版','2','0,2,','1'),
	-- ('雷神GTS巨兽版','2','0,2,','1'),
	-- ('雷神G6000P','2','0,2,','1');
	('雷神新911Pro钛空旗舰版','3','0,3,','1'),
	('雷神911MT暗杀星','3','0,3,','1'),
	('雷神五代新911豪华版','3','0,3,','1'),
	('雷神五代新911旗舰版','3','0,3,','1'),
	('雷神黑金刚K70青轴/黑轴/茶轴/红轴 背光机械键盘','4','0,4,','1'),
	('雷神M201幻彩RGB电竞游戏鼠标','4','0,4,','1'),
	('雷神K30黑轴/青轴/茶轴机械键盘','4','0,4,','1'),
	('雷神铠甲背包橙色','4','0,4,','1');


insert into `goods`(`cid`,`name`,`price`,`store`,`sold`,`up`,`hot`,`desc`,`addtime`,`uptime`) values
	-- ('12','雷神911SE钢版','6499.0','1','329','1','1','金属游戏本，芯八代六核I7-8750H处理器，GTX1050/4G独显，8G内存，128G固态+1T机械，IPS高清屏，【如需升级为16G内存加399元，请购买搭配套餐，并联系客服确认】','1551123222','1551123222'),
	-- ('13','雷神911MT黑骑士','5999.0','6','3256','1','1','芯八代六核I7-8750H处理器，GTX1050Ti/4G独显，8G内存，128G固态+1T机械，IPS高清屏，【如需升级为16G内存加399元，请购买搭配套餐，并联系客服确认】','1551123222','1551123222'),
	-- ('14','雷神911M星耀版','6999.0','4','19','1','1','GTX1060独显，芯八代六核I7-8750H处理器，8G内存，128G固态+1T机械，IPS高清屏，吃鸡利器！【如需升级为16G内存加399元，请购买搭配套餐，并联系客服确认】','1551123222','1551123222'),
	-- ('15','雷神911SE炫彩版','6199.0','7','168','1','1','金属游戏本，全彩键盘，芯八代六核I7-8750H处理器，GTX1050Ti/4G独显，8G内存，128G固态+1T机械，IPS高清屏，【如需升级为16G内存加399元，请购买搭配套餐，并联系客服确认】','1551123222','1551123222'),
	-- ('16','雷神911黑幽灵电竞版','7899.0','1','165','1','1','144HZ电竞屏，芯八代六核I7-8750H处理器，GTX1060/6G独显，16G内存，128G固态+1T机械，I吃鸡利器！【搭配套餐更优惠】','1551123222','1551123222'),
	-- ('17','雷神911Air星战版','6299.0','10','165','1','1','全面屏游戏本，芯八代六核I7-8750H处理器，GTX1050Ti/4G独显，8G内存，128G固态+1T机械，IPS高清屏，LOGO背光灯【升级16G内存加399，请购买搭配套餐】','1551123222','1551123222'),
	-- ('18','雷神911Air电竞版','7499.0','2','95','1','1','全面屏游戏本，144HZ电竞屏，芯八代六核I7-8750H处理器，GTX1050Ti/4G独显，16G内存，128G固态+1T机械，72%色域，正版系统。【搭配套餐更优惠】','1551123222','1551123222'),
	-- ('19','雷神GTS巨兽版','6599.0','5','47','1','1','17.3英寸大屏!窄边框全面屏!I5台式机处理器!72%色域!GTX1050Ti独显！【升级16G内存加399，请购买搭配套餐】','1551123222','1551123222'),
	-- ('20','雷神G6000P','7999.0','0','0','1','1','17.3英寸大屏!窄边框全面屏!I5台式机处理器!72%色域!GTX1050独显！','1551123222','1551123222');
	('21','雷神新911Pro钛空旗舰版','8999.0','19','38','1','1','预售：5月17日发货，芯9代I7-9750H/GTX1660Ti/144hz电竞屏/256G固态+1T/16G内存/RGB键盘/轻薄窄边框/游戏笔记本电脑','1551123222','1551123222'),
	('22','雷神911MT暗杀星','6599.0','0','31','1','1','GTX1650独显，芯9代I7-9750H，8G内存，512G固态，多彩背光键盘，全面屏窄边框金属本。【升级16G内存加399元，升级1T机械硬盘加300元，请购买搭配套餐，并联系客服确认】','1551123222','1551123222'),
	('23','雷神五代新911豪华版','8299.0','8','14','1','1','预售：5月17日发货，芯9代I7-9750H/GTX1660Ti/16.6英寸144hz电竞屏/512G固态/8G内存/RGB键盘/轻薄窄边框/【升级16G内存加399元，升级1T机械硬盘加300元，请购买搭配套餐，并联系客服确认】','1551123222','1551123222'),
	('24','雷神五代新911旗舰版','8999.0','2','16','1','1','芯9代I7-9750H/GTX1660Ti/16.6英寸144hz电竞屏/256G固态+1T机械/16G内存/RGB键盘/轻薄窄边框/游戏笔记本电脑','1551123222','1551123222'),
	('25','雷神黑金刚K70青轴/黑轴/茶轴/红轴 背光机械键盘','299.0','9','2582','1','1','雷神K70金属背光机械键盘，匠心之作，人性化设计，让你从此爱上啪啪啪！','1551123222','1551123222'),
	('26','雷神M201幻彩RGB电竞游戏鼠标','129.0','19','223','1','1','雷神M201电竞级光学游戏鼠标幻彩RGB游戏办公，自由玩色，秒速激情！','1551123222','1551123222'),
	('27','雷神K30黑轴/青轴/茶轴机械键盘','199.0','8','278','1','1','104键无冲吃鸡 游戏键盘电竞机械键盘','1551123222','1551123222'),
	('28','雷神铠甲背包橙色','299.0','6','199','1','1','雷神铠甲包，胆大包天！','1551123222','1551123222');

-- 商品表
create table `goods`(

	`id` 			int 			not null	auto_increment 	primary key,
	`cid` 			int 			not null,
	`name` 			varchar(110)	not null,
	`price` 		decimal(32)  	not null,
	`store` 		int 			not null,
	`sold` 			int 						default 0 	comment '已售数量',
	`up` 			tinyint(1)					default 1	comment '1-上架 2-下架',
	`hot` 			tinyint(1)					default 2	comment '1-热销 2-滞销',
	`desc` 			varchar(255) 	not null,	
	`addtime` 		int(10)			not null,
	`uptime`		int(10)

)engine=myisam default charset=utf8;




create table `goodsImg`(

`id`		int 			not null	unsigned  auto_increment primary key,
`gid`		int				not null ,
`icon`		varchar(255)	not null,
`face`		tinyint(1)		default 2	comment '1-封面 2-非封面'

)engine=myisam default charset=utf8;





insert into `goodsimg`(`gid`,`icon`,`face`) values

	('2','20190511cd6a494csee4.jpg','1'),
	('2','20190511cd6a4ds81ee4.jpg','2'),
	('2','20190511cd6a494ds567.jpg','2'),
	('4','20190511cd6a494dsi89.jpg','2'),
	('4','20190511cd6a494ffee4.jpg','1'),
	('4','20190511cd6a4947d8e4.jpg','2'),
	('5','20190511cd6a49431ead.jpg','2'),
	('5','20190511cd6see631ee4.jpg','1'),
	('5','20190511cds449431ee4.jpg','2'),
	('6','20190511cssa49431ee4.jpg','2'),
	('6','20190511ds4349431ee4.jpg','1'),
	('6','20190511fd6a49431ee4.jpg','2'),
	('8','20190511fs5a49431ee4.jpg','2'),
	('8','201905115c6a49431ee4.jpg','2'),
	('8','20190511cd6a4dsss7d8.jpg','1'),
	('7','20190511cd6a4dss67e4.jpg','1'),
	('7','20190511cd6a4dss6347.jpg','1'),
	('7','20190511342a4dss6347.jpg','1');



-- 评论页表

create table `comment`(

`id`		int 			not null	unsigned  auto_increment primary key,
`uid`		int				not null ,
`gid`		int				not null ,
`comment`	varchar(255),
`tip` 		varchar(255) 	not null

)engine=myisam default charset=utf8;



insert into `comment`(`uid`,`gid`,`comment`,`tip`) values

	('3 ','1','不错不错，很有厚重感','外观时尚,游戏畅爽,运行稳定,开机贼快'),
	('7 ','1','第一次买雷神鼠标，感觉很炫酷，手感也很不错，客服小姐姐服务态度很好，点赞！','运行稳定,开机贼快,视效超棒,快递给力'),
	('8 ','1','客服服务特别好','外观时尚,游戏畅爽,运行稳定,开机贼快,视效超棒,快递给力,客服nice,性价比高'),
	('9 ','3','现在刚用，外观是还可以','开机贼快,视效超棒,快递给力,客服nice,性价比高'),
	('10','3','现在刚用。外观是好可以','开机贼快,视效超棒,快递给力,客服nice,性价比高'),
	('13','3','真的是，帅酷美！没话说的，性价比绝对高！物有所值！','外观时尚,游戏畅爽,运行稳定,开机贼快,视效超棒,快递给力'),
	('15','8','电脑很好看，刚到货，正在体验中……','游戏畅爽,运行稳定,开机贼快'),
	('14','8','外观很帅 很是喜欢 就是发烫有点快 刚开机一会就很烫了 所以建议改良一下 总体来说还是很好的！','外观时尚,游戏畅爽,运行稳定,开机贼快,视效超棒,快递给力,客服nice'),
	('5 ','8','东西不错快递很给力','开机贼快,视效超棒,快递给力,客服nice,性价比高'),
	('6 ','9','555，超美貌！超级棒！包装也超级赞！','游戏畅爽,运行稳定,开机贼快'),
	('11','9','快递速度还可以，本子比我想象中要薄，键盘的手感打字还可以玩游戏还是用外接键盘吧。外观也相当的帅气，尤其是蓝夜光带特别炫目，没开游戏正常使用cpu温度在55~60之间还可以吧，目前还没有发现什么问题，一切正在体验中。','外观时尚,游戏畅爽,运行稳定,开机贼快,视效超棒,快递给力,客服nice'),
	('12','9','发货速度快，原装正品值得信赖。性价比超高专业。','开机贼快,视效超棒,快递给力,客服nice,性价比高'),
	('16','10','刚到手，看着挺好，希望不要翻车，选了好久才买的','游戏畅爽,运行稳定,开机贼快'),
	('1','10','背包没送','外观时尚,游戏畅爽,运行稳定,开机贼快,视效超棒,快递给力'),
	('3 ','11','不错不错，很有厚重感','外观时尚,游戏畅爽,运行稳定,开机贼快'),
	('7 ','11','第一次买雷神鼠标，感觉很炫酷，手感也很不错，客服小姐姐服务态度很好，点赞！','运行稳定,开机贼快,视效超棒,快递给力'),
	('8 ','11','客服服务特别好','外观时尚,游戏畅爽,运行稳定,开机贼快,视效超棒,快递给力,客服nice,性价比高'),
	('9 ','12','现在刚用，外观是还可以','开机贼快,视效超棒,快递给力,客服nice,性价比高'),
	('10','12','现在刚用。外观是好可以','开机贼快,视效超棒,快递给力,客服nice,性价比高'),
	('13','12','真的是，帅酷美！没话说的，性价比绝对高！物有所值！','外观时尚,游戏畅爽,运行稳定,开机贼快,视效超棒,快递给力'),
	('15','13','电脑很好看，刚到货，正在体验中……','游戏畅爽,运行稳定,开机贼快'),
	('17','13','外观很帅 很是喜欢 就是发烫有点快 刚开机一会就很烫了 所以建议改良一下 总体来说还是很好的！','外观时尚,游戏畅爽,运行稳定,开机贼快,视效超棒,快递给力,客服nice'),
	('5 ','13','东西不错快递很给力','开机贼快,视效超棒,快递给力,客服nice,性价比高'),
	('6 ','14','555，超美貌！超级棒！包装也超级赞！','游戏畅爽,运行稳定,开机贼快'),
	('11','14','快递速度还可以，本子比我想象中要薄，键盘的手感打字还可以玩游戏还是用外接键盘吧。外观也相当的帅气，尤其是蓝夜光带特别炫目，没开游戏正常使用cpu温度在55~60之间还可以吧，目前还没有发现什么问题，一切正在体验中。','外观时尚,游戏畅爽,运行稳定,开机贼快,视效超棒,快递给力,客服nice'),
	('12','15','发货速度快，原装正品值得信赖。性价比超高专业。','开机贼快,视效超棒,快递给力,客服nice,性价比高'),
	('16','15','刚到手，看着挺好，希望不要翻车，选了好久才买的','游戏畅爽,运行稳定,开机贼快'),
	('8','15','背包没送','外观时尚,游戏畅爽,运行稳定,开机贼快,视效超棒,快递给力'),
	('15','16','电脑很好看，刚到货，正在体验中……','游戏畅爽,运行稳定,开机贼快'),
	('17','16','外观很帅 很是喜欢 就是发烫有点快 刚开机一会就很烫了 所以建议改良一下 总体来说还是很好的！','外观时尚,游戏畅爽,运行稳定,开机贼快,视效超棒,快递给力,客服nice'),
	('5 ','17','东西不错快递很给力','开机贼快,视效超棒,快递给力,客服nice,性价比高'),
	('6 ','17','555，超美貌！超级棒！包装也超级赞！','游戏畅爽,运行稳定,开机贼快'),
	('11','17','快递速度还可以，本子比我想象中要薄，键盘的手感打字还可以玩游戏还是用外接键盘吧。外观也相当的帅气，尤其是蓝夜光带特别炫目，没开游戏正常使用cpu温度在55~60之间还可以吧，目前还没有发现什么问题，一切正在体验中。','外观时尚,游戏畅爽,运行稳定,开机贼快,视效超棒,快递给力,客服nice'),
	('12','15','发货速度快，原装正品值得信赖。性价比超高专业。','开机贼快,视效超棒,快递给力,客服nice,性价比高'),
	('16','15','刚到手，看着挺好，希望不要翻车，选了好久才买的','游戏畅爽,运行稳定,开机贼快'),
	('8','5','背包没送','外观时尚,游戏畅爽,运行稳定,开机贼快,视效超棒,快递给力');


外观时尚,游戏畅爽,运行稳定,开机贼快,视效超棒,快递给力,客服nice,性价比高

-- 评论页图片表
create table `commentimg`(

`id`		int 			not null	unsigned  auto_increment primary key,
`gid`		int				not null ,
`pic` 		varchar(255) 	not null

)engine=myisam default charset=utf8;


insert into `commentimg`(`gid`,`pic`) values

	('12','20190511cd6a494csee4.jpg'),
	('12','20190511cd6a4ds81ee4.jpg'),
	('12','20190511cd6a494ds567.jpg'),
	('14','20190511cd6a494dsi89.jpg'),
	('14','20190511cd6a494ffee4.jpg'),
	('14','20190511cd6a4947d8e4.jpg'),
	('15','20190511cd6a49431ead.jpg'),
	('15','20190511cd6see631ee4.jpg'),
	('15','20190511cds449431ee4.jpg'),
	('6 ','20190511cssa49431ee4.jpg'),
	('6 ','20190511ds4349431ee4.jpg'),
	('6 ','20190511fd6a49431ee4.jpg'),
	('8 ','20190511fs5a49431ee4.jpg'),
	('8 ','201905115c6a49431ee4.jpg'),
	('8 ','20190511cd6a4dsss7d8.jpg');




-- 购物车表
create table if not exists `address`(
	`id` int auto_increment primary key,
	`uid` int not null comment '用户id',
	`receiver` varchar(50) not null comment '收货人',
	`address` varchar(255) not null comment '收货地址',
	`phone` char(11) not null comment '联系电话',
	`is_default` tinyint(1) default 1 comment '默认收货地址  1-默认  2-非默认'
)engine=myisam default charset=utf8;


insert into `address` (`uid`,`receiver`,`address`,`phone`,`is_default`) values
	(3,'钟馗','召唤师峡谷河道','15000000897',2),
	(3,'钟馗','召唤师峡谷1158号','15000000003',1),
	(3,'钟馗','王者峡谷上路曹村','15033477772',2),
	(7,'无名','宝马车上','15000033221',1),
	(7,'无名','有道云村','15000004443',2),
	(8,'路飞','朝天飞船','17800004443',1),
	(8,'路飞','朝天飞船001号','17800004456',2),
	(33,'home','上海市1188号','15890004443',1),
	(33,'home','北京市天安门五道口','15890004444',2);

-- 订单表
create table if not exists `orders`(
	`id` int unsigned auto_increment primary key,
	`orderNum` varchar(255) not null unique comment '订单编号',
	`uid` int not null comment '用户id',
	`receiver` varchar(50) not null comment '收货人',
	`address` varchar(255) not null comment '收货地址',
	`phone` char(11) not null comment '联系电话',
	`amount` decimal(10,2) not null comment '总价',
	`time` int(10) not null comment '下单时间',
	`orderWay` tinyint(1) default 1 comment '支付方式 1-货到付款 2-在线支付',
	`status` tinyint(1) default 2 comment '发货状态 1-已发货 2-未发货 3-已收货',
	`isPay` tinyint(1)  default 1 comment '是否支付 1-已支付 2-未支付',
	`cancel` tinyint(1) default 2 comment '取消状态 1-取消   2-未取消'
)engine=myisam default charset=utf8;


-- 商品订单表
create table if not exists `ordersGood`(
	`id` int unsigned auto_increment primary key,
	`oid` int  not null comment '订单id',
	`gid` int  not null comment '商品id',
	`price` decimal(10,2) not null comment '当时购买的单价',
	`count` int not null comment '数量'
)engine=myisam default charset=utf8;


-- 商品首页分类表
create table `category2`(

`id`		int 			not null	  auto_increment	primary key,
`name`		varchar(50)		not null 	unique,
`pid`		int 			not null	default 0	comment '0-顶级分类',
`path`		varchar(255)	not null	default 0	comment '一级分类',
`display`	tinyint			not null	default 2	comment '1-显示,2-隐藏'

)engine=myisam default charset=utf8;

